In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from functools import partial

from os import path

In [2]:
MAIN_PATH = path.join("..")
DATA_PATH = path.join(MAIN_PATH, "data")
FILE_PATH = path.join(MAIN_PATH, "{data_path}", "{0}").format
FILE_PATH = partial(FILE_PATH, data_path="data")
FILE_PATH("HOLA", data_path="cleaned_data"), FILE_PATH("HOLA")

('..\\cleaned_data\\HOLA', '..\\data\\HOLA')

In [3]:
from os import listdir

files_list = listdir(DATA_PATH)
df = {name: pd.read_csv(FILE_PATH(name)) for name in files_list}
SALES_RECIEPTS, CUSTOMER, DATES, GENERATIONS, PASTRY_INV, PRODUCT, SALES_TARGET, SALES_OUTLET, STAFF = files_list
files_list

['201904 sales reciepts.csv',
 'customer.csv',
 'Dates.csv',
 'generations.csv',
 'pastry inventory.csv',
 'product.csv',
 'sales targets.csv',
 'sales_outlet.csv',
 'staff.csv']

# Sales Reciepts

In [4]:
df_sales_rec = df[SALES_RECIEPTS]
df_sales_rec.head()

,transaction_id,transaction_date,transaction_time,sales_outlet_id,staff_id,customer_id,instore_yn,order,line_item_id,product_id,quantity,line_item_amount,unit_price,promo_item_yn
0,7,2019-04-01,12:04:43,3,12,558,N,1,1,52,1,2.50,2.50,N
1,11,2019-04-01,15:54:39,3,17,781,N,1,1,27,2,7.00,3.50,N
2,19,2019-04-01,14:34:59,3,17,788,Y,1,1,46,2,5.00,2.50,N
3,32,2019-04-01,16:06:04,3,12,683,N,1,1,23,2,5.00,2.50,N
4,33,2019-04-01,19:18:37,3,17,99,Y,1,1,34,1,2.45,2.45,N

In [5]:
ordered_df_sales_rec = df_sales_rec.sort_values(["transaction_date", "transaction_time", "sales_outlet_id", "staff_id"])
ordered_df_sales_rec.reset_index(drop=True, inplace=True)
ordered_df_sales_rec.head(50)

,transaction_id,transaction_date,transaction_time,sales_outlet_id,staff_id,customer_id,instore_yn,order,line_item_id,product_id,quantity,line_item_amount,unit_price,promo_item_yn
0,390,2019-04-01,07:01:20,5,12,5658,Y,1,1,22,2,4.00,2.00,N
1,2465,2019-04-01,07:02:34,5,12,5163,Y,1,1,30,2,6.00,3.00,N
2,1228,2019-04-01,07:02:56,5,30,5197,N,1,1,22,1,2.00,2.00,N
3,1644,2019-04-01,07:03:30,5,12,5247,Y,1,1,22,2,4.00,2.00,N
4,1034,2019-04-01,07:04:24,5,30,5333,N,1,1,37,1,3.00,3.00,N
5,1338,2019-04-01,07:06:11,5,30,5465,Y,1,1,32,2,6.00,3.00,N
6,799,2019-04-01,07:06:29,5,12,5923,N,1,1,46,1,2.50,2.50,N
7,2257,2019-04-01,07:06:32,5,30,5627,N,1,1,22,1,2.00,2.00,N
8,2254,2019-04-01,07:07:09,5,30,5340,N,1,1,59,2,9.00,4.50,N
9,994,2019-04-01,07:07:19,5,12,5806,Y,1,1,61,1,4.75,4.75,N
10,399,2019-04-01,07:08:56,5,30,5895,Y,1,1,57,2,6.20,3.10,N
11,1269,2019-04-01,07:09:09,5,30,5583,N,1,1,49,1,3.00,3.00,N
12,1127,2019-04-01,07:09:59,5,30,5073,Y,1,1,61,2,9.50,4.75,N
13,1490,2019-04-01,07:12:10,5,30,5050,N,1,1,45,1,3.00,3.00,N
14,451,2019-04-01,07:14:04,5,26,5412,N,1,1,59,2,9.00,4.50,N
15,981,2019-04-01,07:15:02,5,26,5376,N,1,1,34,1,2.45,2.45,N
16,991,2019-04-01,07:18:04,5,26,5224,N,1,1,44,1,2.50,2.50,N
17,1154,2019-04-01,07:19:13,5,30,5439,Y,1,1,39,1,4.25,4.25,N
18,1154,2019-04-01,07:19:13,5,30,5439,Y,1,5,77,1,3.00,3.00,N
19,1132,2019-04-01,07:20:00,5,12,5720,N,1,1,54,2,5.00,2.50,N
20,1170,2019-04-01,07:20:24,5,12,5676,Y,1,1,22,1,2.00,2.00,N
21,1437,2019-04-01,07:20:59,5,30,5907,Y,1,1,50,2,5.00,2.50,N
22,625,2019-04-01,07:21:23,5,26,5921,Y,1,1,54,2,5.00,2.50,N
23,2264,2019-04-01,07:22:41,5,12,5162,Y,1,1,40,1,3.75,3.75,N
24,248,2019-04-01,07:22:41,5,30,5479,N,1,1,57,2,6.20,3.10,N
25,248,2019-04-01,07:22:41,5,30,5479,N,1,5,77,1,3.00,3.00,N
26,1994,2019-04-01,07:24:20,5,30,5514,N,1,1,53,1,3.00,3.00,N
27,2391,2019-04-01,07:25:09,5,26,5743,Y,1,1,56,2,5.10,2.55,N
28,2391,2019-04-01,07:25:09,5,26,5743,Y,1,5,74,1,3.50,3.50,N
29,897,2019-04-01,07:25:39,5,30,5164,Y,1,1,47,2,6.00,3.00,N
30,335,2019-04-01,07:25:49,5,12,5543,Y,1,1,22,1,2.00,2.00,N
31,1933,2019-04-01,07:26:59,5,12,5178,N,1,1,27,2,7.00,3.50,N
32,2488,2019-04-01,07:27:26,5,26,5635,Y,1,1,53,2,6.00,3.00,N
33,2344,2019-04-01,07:27:31,5,12,5672,N,1,1,32,1,3.00,3.00,N
34,2344,2019-04-01,07:27:31,5,12,5672,N,1,5,71,1,3.75,3.75,N
35,1735,2019-04-01,07:32:03,5,12,5630,Y,1,1,61,2,9.50,4.75,N
36,2147,2019-04-01,07:33:34,5,26,5195,N,1,1,28,2,4.00,2.00,N
37,1911,2019-04-01,07:39:13,5,12,5231,Y,1,1,39,1,4.25,4.25,N
38,2399,2019-04-01,07:39:34,5,30,5489,Y,1,1,58,2,7.00,3.50,N
39,1023,2019-04-01,07:41:18,5,30,5227,Y,1,1,34,2,4.90,2.45,N
40,1866,2019-04-01,07:41:34,5,12,5115,N,1,1,22,1,2.00,2.00,N
41,534,2019-04-01,07:43:05,5,26,5373,N,1,1,56,1,2.55,2.55,N
42,1295,2019-04-01,07:44:35,5,12,5162,N,1,1,33,2,7.00,3.50,N
43,2475,2019-04-01,07:45:51,5,30,5394,N,1,1,51,1,3.00,3.00,N
44,330,2019-04-01,07:46:28,5,26,5291,Y,1,1,24,2,6.00,3.00,N
45,330,2019-04-01,07:46:28,5,26,5291,Y,1,5,72,1,3.25,3.25,N
46,2428,2019-04-01,07:46:30,5,26,5508,N,1,1,47,2,6.00,3.00,N
47,2255,2019-04-01,07:47:02,5,12,5278,N,1,1,58,2,7.00,3.50,N
48,1483,2019-04-01,07:48:19,5,12,5491,N,1,1,57,1,3.10,3.10,N
49,865,2019-04-01,07:49:41,5,30,5593,N,1,1,50,2,5.00,2.50,N

In [6]:
gen = ordered_df_sales_rec.iterrows()

last_i, last_row = next(gen)

repeated_list = []

c0 = "transaction_id"
c1, c2, c3, c4 = "transaction_date", "transaction_time", "sales_outlet_id", "staff_id"

at1_1, at2_1, at3_1, at4_1 = last_row[c1], last_row[c2], last_row[c3], last_row[c4]
ordered_df_sales_rec.loc[0, c0] = 0

for i, row in gen:
    ordered_df_sales_rec.loc[i, c0] = ordered_df_sales_rec.loc[i-1, c0] + 1
    last_row = ordered_df_sales_rec.loc[i-1]
    at1_1, at2_1, at3_1, at4_1 = last_row[c1], last_row[c2], last_row[c3], last_row[c4]
    at1_2, at2_2, at3_2, at4_2 = row[c1], row[c2], row[c3], row[c4]
    if (at1_1 == at1_2 and at2_1 == at2_2 and at3_1 == at3_2 and at4_1 == at4_2):
        ordered_df_sales_rec.loc[i, c0] = ordered_df_sales_rec.loc[i-1, c0]
        repeated_list.append(last_row)
        repeated_list.append(row)

In [7]:
ordered_df_sales_rec["transaction_date"] = pd.to_datetime(ordered_df_sales_rec["transaction_date"], yearfirst=True)
ordered_df_sales_rec.head()

,transaction_id,transaction_date,transaction_time,sales_outlet_id,staff_id,customer_id,instore_yn,order,line_item_id,product_id,quantity,line_item_amount,unit_price,promo_item_yn
0,0,2019-04-01,07:01:20,5,12,5658,Y,1,1,22,2,4.0,2.0,N
1,1,2019-04-01,07:02:34,5,12,5163,Y,1,1,30,2,6.0,3.0,N
2,2,2019-04-01,07:02:56,5,30,5197,N,1,1,22,1,2.0,2.0,N
3,3,2019-04-01,07:03:30,5,12,5247,Y,1,1,22,2,4.0,2.0,N
4,4,2019-04-01,07:04:24,5,30,5333,N,1,1,37,1,3.0,3.0,N

In [8]:
ordered_df_sales_rec.transaction_date

0       2019-04-01
1       2019-04-01
2       2019-04-01
3       2019-04-01
4       2019-04-01
           ...
49889   2019-04-29
49890   2019-04-29
49891   2019-04-29
49892   2019-04-29
49893   2019-04-29
Name: transaction_date, Length: 49894, dtype: datetime64[ns]

In [61]:
columns = [
    "transaction_id",
    "product_id",
    "staff_id",
    "customer_id",
    "sales_outlet_id",
    "transaction_date",
    "transaction_time",
    "quantity"
]
df_to_save = ordered_df_sales_rec[columns]
df_to_save.drop_duplicates(inplace=True)
print(len(df_to_save))
df_to_save.loc[11658, "quantity"] = 3
del df_to_save.loc[11660]
df_to_save.head()

49752

C:\Users\asoln\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\util\_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)
C:\Users\asoln\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\indexing.py:1817: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

AttributeError: __delitem__

In [60]:
df_to_save[df_to_save["transaction_id"] == 9825]

,transaction_id,product_id,staff_id,customer_id,sales_outlet_id,transaction_date,transaction_time,quantity
11658,9825,37,25,0,5,2019-04-08,08:22:37,1
11659,9825,65,25,0,5,2019-04-08,08:22:37,2
11660,9825,37,25,0,5,2019-04-08,08:22:37,2

In [58]:
df_to_save.to_csv(
    FILE_PATH("SalesReceipt.csv", data_path="cleaned_data"),
    index=False,
)

# Dates

In [11]:
df_dates = df[DATES]
df_dates["transaction_date"] = pd.to_datetime(df_dates["transaction_date"], yearfirst=True)
df_dates.head()

,transaction_date,Date_ID,Week_ID,Week_Desc,Month_ID,Month_Name,Quarter_ID,Quarter_Name,Year_ID
0,2019-04-01,20190401,14,Week 14,4,April,2,Q2,2019
1,2019-04-02,20190402,14,Week 14,4,April,2,Q2,2019
2,2019-04-03,20190403,14,Week 14,4,April,2,Q2,2019
3,2019-04-04,20190404,14,Week 14,4,April,2,Q2,2019
4,2019-04-05,20190405,14,Week 14,4,April,2,Q2,2019

In [12]:
columns = [
    "transaction_date",
    "Month_ID",
    "Week_ID",
    "Quarter_ID",
]
df_to_save = df_dates[columns]
df_to_save.head()

  transaction_date  Month_ID  Week_ID  Quarter_ID
0       2019-04-01         4       14           2
1       2019-04-02         4       14           2
2       2019-04-03         4       14           2
3       2019-04-04         4       14           2
4       2019-04-05         4       14           2

In [14]:
df_to_save.to_csv(
    FILE_PATH("TransactionDate.csv", data_path="cleaned_data"),
    index=False,
    header=[
        "transaction_date",
        "month_id",
        "week_id",
        "quarter_id",
    ]
)

# MonthName

In [15]:
list_to_df = [
    [ 1, "January"],
    [ 2, "February"],
    [ 3, "March"],
    [ 4, "April"],
    [ 5, "May"],
    [ 6, "June"],
    [ 7, "July"],
    [ 8, "August"],
    [ 9, "September"],
    [10, "Octuber"],
    [11, "November"],
    [12, "December"],
]
df_month_name = pd.DataFrame(list_to_df,
                             columns=["month_id", "month_name"])
df_month_name

    month_id month_name
0          1    January
1          2   February
2          3      March
3          4      April
4          5        May
5          6       June
6          7       July
7          8     August
8          9  September
9         10    Octuber
10        11   November
11        12   December

In [16]:
df_month_name.to_csv(
    FILE_PATH("MonthName.csv", data_path="cleaned_data"),
    index=False,
)

# Customer

In [17]:
df_customer = df[CUSTOMER]
df_customer["customer_since"] = pd.to_datetime(df_customer["customer_since"], yearfirst=True)
df_customer["birthdate"] = pd.to_datetime(df_customer["birthdate"], yearfirst=True)
df_customer.head()

,customer_id,home_store,customer_first-name,customer_email,customer_since,loyalty_card_number,birthdate,gender,birth_year
0,1,3,Kelly Key,Venus@adipiscing.edu,2017-01-04,908-424-2890,1950-05-29,M,1950
1,2,3,Clark Schroeder,Nora@fames.gov,2017-01-07,032-732-6308,1950-07-30,M,1950
2,3,3,Elvis Cardenas,Brianna@tellus.edu,2017-01-10,459-375-9187,1950-09-30,M,1950
3,4,3,Rafael Estes,Ina@non.gov,2017-01-13,576-640-9226,1950-12-01,M,1950
4,5,3,Colin Lynn,Dale@Integer.com,2017-01-15,344-674-6569,1951-02-01,M,1951

In [19]:
columns = [
    "customer_id",
    "home_store",
    "customer_first-name",  # customer_name
    "customer_email",
    "customer_since",
    "loyalty_card_number",
    "birthdate",
    "birth_year",
    "gender",  # is_female
]
df_to_save = df_customer[columns]
df_to_save

,customer_id,home_store,customer_first-name,customer_email,customer_since,loyalty_card_number,birthdate,birth_year,gender
0,1,3,Kelly Key,Venus@adipiscing.edu,2017-01-04,908-424-2890,1950-05-29,1950,M
1,2,3,Clark Schroeder,Nora@fames.gov,2017-01-07,032-732-6308,1950-07-30,1950,M
2,3,3,Elvis Cardenas,Brianna@tellus.edu,2017-01-10,459-375-9187,1950-09-30,1950,M
3,4,3,Rafael Estes,Ina@non.gov,2017-01-13,576-640-9226,1950-12-01,1950,M
4,5,3,Colin Lynn,Dale@Integer.com,2017-01-15,344-674-6569,1951-02-01,1951,M
...,...,...,...,...,...,...,...,...,...
2241,8497,8,Rae,Kylie@facilisi.org,2017-01-06,081-440-6679,1977-12-10,1977,F
2242,8498,8,April,Daniel@placerat.us,2019-01-20,705-545-5246,2000-12-07,2000,N
2243,8499,8,Clementine,Dieter@ac.us,2017-11-09,297-550-7776,1996-06-04,1996,F
2244,8500,8,Linda,Dillon@pretium.gov,2017-08-21,255-202-7435,1990-03-01,1990,N
2245,8501,8,Moana,Herrod@ultrices.gov,2018-07-06,241-906-4009,1966-08-27,1966,F

In [20]:
df_to_save["gender"] = df_to_save.loc[:, "gender"].replace("F", 1).replace("M", 0).replace("N", np.nan).astype("Int8")
df_to_save

,customer_id,home_store,customer_first-name,customer_email,customer_since,loyalty_card_number,birthdate,birth_year,gender
0,1,3,Kelly Key,Venus@adipiscing.edu,2017-01-04,908-424-2890,1950-05-29,1950,0
1,2,3,Clark Schroeder,Nora@fames.gov,2017-01-07,032-732-6308,1950-07-30,1950,0
2,3,3,Elvis Cardenas,Brianna@tellus.edu,2017-01-10,459-375-9187,1950-09-30,1950,0
3,4,3,Rafael Estes,Ina@non.gov,2017-01-13,576-640-9226,1950-12-01,1950,0
4,5,3,Colin Lynn,Dale@Integer.com,2017-01-15,344-674-6569,1951-02-01,1951,0
...,...,...,...,...,...,...,...,...,...
2241,8497,8,Rae,Kylie@facilisi.org,2017-01-06,081-440-6679,1977-12-10,1977,1
2242,8498,8,April,Daniel@placerat.us,2019-01-20,705-545-5246,2000-12-07,2000,<NA>
2243,8499,8,Clementine,Dieter@ac.us,2017-11-09,297-550-7776,1996-06-04,1996,1
2244,8500,8,Linda,Dillon@pretium.gov,2017-08-21,255-202-7435,1990-03-01,1990,<NA>
2245,8501,8,Moana,Herrod@ultrices.gov,2018-07-06,241-906-4009,1966-08-27,1966,1

In [22]:
df_to_save.to_csv(
    FILE_PATH("Customer.csv", data_path="cleaned_data"),
    index=False,
    header=[
        "customer_id",
        "home_store",
        "customer_name",  # customer_name
        "customer_email",
        "customer_since",
        "loyalty_card_number",
        "birthdate",
        "birth_year",
        "is_female",  # is_female
    ]
)

# Generation

In [23]:
df_generations = df[GENERATIONS]
df_generations

    birth_year    generation
0         1946  Baby Boomers
1         1947  Baby Boomers
2         1948  Baby Boomers
3         1949  Baby Boomers
4         1950  Baby Boomers
..         ...           ...
65        2011         Gen Z
66        2012         Gen Z
67        2013         Gen Z
68        2014         Gen Z
69        2015         Gen Z

[70 rows x 2 columns]

In [24]:
df_generations.to_csv(
    FILE_PATH("Generation.csv", data_path="cleaned_data"),
    index=False,
)

# PastryInventory

In [25]:
df_pastry_inventory = df[PASTRY_INV]
df_pastry_inventory["transaction_date"] = pd.to_datetime(df_pastry_inventory["transaction_date"], yearfirst=True)
df_pastry_inventory.head()

,sales_outlet_id,transaction_date,product_id,start_of_day,quantity_sold,waste,% waste
0,3,2019-04-01,69,18,8,10,56%
1,3,2019-04-01,70,18,12,6,33%
2,3,2019-04-01,71,18,8,10,56%
3,3,2019-04-01,72,48,9,39,81%
4,3,2019-04-01,73,18,9,9,50%

In [26]:
columns = [
    "sales_outlet_id",
    "transaction_date",
    "product_id",
    "start_of_day",  # quantity_cooked
    "quantity_sold",
]
df_to_save = df_pastry_inventory[columns]
df_to_save

     sales_outlet_id transaction_date  product_id  start_of_day  quantity_sold
0                  3       2019-04-01          69            18              8
1                  3       2019-04-01          70            18             12
2                  3       2019-04-01          71            18              8
3                  3       2019-04-01          72            48              9
4                  3       2019-04-01          73            18              9
..               ...              ...         ...           ...            ...
302                8       2019-04-27          69            18              1
303                8       2019-04-27          70            18              4
304                8       2019-04-27          71            18              2
305                8       2019-04-27          72            48             19
306                8       2019-04-27          73            18              4

[307 rows x 5 columns]

In [27]:
df_to_save.to_csv(
    FILE_PATH("PastryInventory.csv", data_path="cleaned_data"),
    index=False,
    header=[
        "sales_outlet_id",
        "transaction_date",
        "product_id",
        "quantity_cooked",  # quantity_cooked
        "quantity_sold",
    ]
)

# Product

In [28]:
df_product = df[PRODUCT]
df_product.head()

,product_id,product_group,product_category,product_type,product,product_description,unit_of_measure,current_wholesale_price,current_retail_price,tax_exempt_yn,promo_yn,new_product_yn
0,1,Whole Bean/Teas,Coffee beans,Organic Beans,Brazilian - Organic,It's like Carnival in a cup. Clean and smooth.,12 oz,14.40,$18.00,Y,N,N
1,2,Whole Bean/Teas,Coffee beans,House blend Beans,Our Old Time Diner Blend,Out packed blend of beans that is reminiscent ...,12 oz,14.40,$18.00,Y,N,N
2,3,Whole Bean/Teas,Coffee beans,Espresso Beans,Espresso Roast,Our house blend for a good espresso shot.,1 lb,11.80,$14.75,Y,N,N
3,4,Whole Bean/Teas,Coffee beans,Espresso Beans,Primo Espresso Roast,Our primium single source of hand roasted beans.,1 lb,16.36,$20.45,Y,N,N
4,5,Whole Bean/Teas,Coffee beans,Gourmet Beans,Columbian Medium Roast,A smooth cup of coffee any time of day.,1 lb,12.00,$15.00,Y,N,N

In [29]:
df_product["product_group"].unique()

array(['Whole Bean/Teas', 'Beverages', 'Add-ons', 'Food', 'Merchandise'],
      dtype=object)

In [30]:
df_product["product_category"].unique()

array(['Coffee beans', 'Loose Tea', 'Packaged Chocolate', 'Coffee', 'Tea',
       'Drinking Chocolate', 'Flavours', 'Bakery', 'Branded'],
      dtype=object)

In [31]:
df_product["product_type"].unique()

array(['Organic Beans', 'House blend Beans', 'Espresso Beans',
       'Gourmet Beans', 'Premium Beans', 'Green beans', 'Herbal tea',
       'Black tea', 'Green tea', 'Chai tea', 'Drinking Chocolate',
       'Organic Chocolate', 'Drip coffee', 'Organic brewed coffee',
       'Gourmet brewed coffee', 'Premium brewed coffee',
       'Barista Espresso', 'Brewed herbal tea', 'Brewed Green tea',
       'Brewed Black tea', 'Brewed Chai tea', 'Hot chocolate',
       'Regular syrup', 'Sugar free syrup', 'Seasonal drink', 'Pastry',
       'Scone', 'Biscotti', 'Clothing', 'Housewares', 'Specialty coffee'],
      dtype=object)

In [32]:
df_product["current_retail_price"]

0     $18.00
1     $18.00
2     $14.75
3     $20.45
4     $15.00
       ...
83     $0.80
84     $6.00
85     $3.00
86     $2.10
87     $2.65
Name: current_retail_price, Length: 88, dtype: object

In [33]:
columns = [
    "product_id",
    "product",
    "current_retail_price",
    "product_group",
    "product_category",
    "product_type",
]
df_to_save = df_product[columns]
df_to_save

,product_id,product,current_retail_price,product_group,product_category,product_type
0,1,Brazilian - Organic,$18.00,Whole Bean/Teas,Coffee beans,Organic Beans
1,2,Our Old Time Diner Blend,$18.00,Whole Bean/Teas,Coffee beans,House blend Beans
2,3,Espresso Roast,$14.75,Whole Bean/Teas,Coffee beans,Espresso Beans
3,4,Primo Espresso Roast,$20.45,Whole Bean/Teas,Coffee beans,Espresso Beans
4,5,Columbian Medium Roast,$15.00,Whole Bean/Teas,Coffee beans,Gourmet Beans
...,...,...,...,...,...,...
83,84,Chocolate syrup,$0.80,Add-ons,Flavours,Regular syrup
84,85,Rio Nights,$6.00,Beverages,Coffee,Specialty coffee
85,87,Ouro Brasileiro shot,$3.00,Beverages,Coffee,Barista Espresso
86,88,Ouro Brasileiro shot promo,$2.10,Beverages,Coffee,Barista Espresso
87,89,Ginger Scone promo,$2.65,Food,Bakery,Scone

In [34]:
df_to_save.to_csv(
    FILE_PATH("Product.csv", data_path="cleaned_data"),
    index=False,
)

# SalesTarget

In [35]:
df_sales_target = df[SALES_TARGET]
df_sales_target.head()

,sales_outlet_id,year_month,beans_goal,beverage_goal,food_goal,merchandise _goal,total_goal
0,3,Apr-19,720,13500,3420,360,18000
1,4,Apr-19,720,13500,3420,360,18000
2,5,Apr-19,1000,18750,4750,500,25000
3,6,Apr-19,720,13500,3420,360,18000
4,7,Apr-19,720,13500,3420,360,18000

In [36]:
columns = [
    "sales_outlet_id",
    "year_month",
    "beans_goal",
    "beverage_goal",
    "food_goal",
    "merchandise _goal",  # merchandise_goal
]
df_to_save = df_sales_target[columns]

In [37]:
df_to_save.to_csv(
    FILE_PATH("SalesTarget.csv", data_path="cleaned_data"),
    index=False,
    header=[
        "sales_outlet_id",
        "year_month",
        "beans_goal",
        "beverage_goal",
        "food_goal",
        "merchandise_goal",  # merchandise_goal
    ]
)

# SalesOutlet

In [38]:
df_sales_outlet = df[SALES_OUTLET]
df_sales_outlet.head()

,sales_outlet_id,sales_outlet_type,store_square_feet,store_address,store_city,store_state_province,store_telephone,store_postal_code,store_longitude,store_latitude,manager,Neighorhood
0,2,warehouse,3400,164-14 Jamaica Ave,Jamaica,NY,972-871-0402,11432,-73.795168,40.705226,NaN,Jamaica
1,3,retail,1300,32-20 Broadway,Long Island City,NY,777-718-3190,11106,-73.924008,40.761196,6.0,Astoria
2,4,retail,1300,604 Union Street,Brooklyn,NY,619-347-5193,11215,-73.983984,40.677645,11.0,Gowanus
3,5,retail,900,100 Church Street,New York,NY,343-212-5151,10007,-74.010130,40.713290,16.0,Lower Manhattan
4,6,retail,1000,122 E Broadway,New York,NY,613-555-4989,10002,-73.992687,40.713852,21.0,Lower East Side

In [39]:
df_sales_outlet["manager"] = df_sales_outlet["manager"].astype("Int8")
df_sales_outlet.head()

,sales_outlet_id,sales_outlet_type,store_square_feet,store_address,store_city,store_state_province,store_telephone,store_postal_code,store_longitude,store_latitude,manager,Neighorhood
0,2,warehouse,3400,164-14 Jamaica Ave,Jamaica,NY,972-871-0402,11432,-73.795168,40.705226,<NA>,Jamaica
1,3,retail,1300,32-20 Broadway,Long Island City,NY,777-718-3190,11106,-73.924008,40.761196,6,Astoria
2,4,retail,1300,604 Union Street,Brooklyn,NY,619-347-5193,11215,-73.983984,40.677645,11,Gowanus
3,5,retail,900,100 Church Street,New York,NY,343-212-5151,10007,-74.010130,40.713290,16,Lower Manhattan
4,6,retail,1000,122 E Broadway,New York,NY,613-555-4989,10002,-73.992687,40.713852,21,Lower East Side

In [40]:
# HQ
col_names = list(df_sales_outlet.columns)
col_values = [0, "headquarter", pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA]
df_sales_outlet = df_sales_outlet.append({name: val for name, val in zip(col_names, col_values)}, ignore_index=True)
col_values = [1, "FL", pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA, pd.NA]
df_sales_outlet = df_sales_outlet.append({name: val for name, val in zip(col_names, col_values)}, ignore_index=True)

In [41]:
df_sales_outlet.head()

,sales_outlet_id,sales_outlet_type,store_square_feet,store_address,store_city,store_state_province,store_telephone,store_postal_code,store_longitude,store_latitude,manager,Neighorhood
0,2,warehouse,3400,164-14 Jamaica Ave,Jamaica,NY,972-871-0402,11432,-73.795168,40.705226,<NA>,Jamaica
1,3,retail,1300,32-20 Broadway,Long Island City,NY,777-718-3190,11106,-73.924008,40.761196,6,Astoria
2,4,retail,1300,604 Union Street,Brooklyn,NY,619-347-5193,11215,-73.983984,40.677645,11,Gowanus
3,5,retail,900,100 Church Street,New York,NY,343-212-5151,10007,-74.010130,40.713290,16,Lower Manhattan
4,6,retail,1000,122 E Broadway,New York,NY,613-555-4989,10002,-73.992687,40.713852,21,Lower East Side

In [42]:
df_sales_outlet["store_square_feet"] = df_sales_outlet["store_square_feet"].astype("Int64")
df_sales_outlet["store_postal_code"] = df_sales_outlet["store_postal_code"].astype("Int64")

In [43]:
df_sales_outlet.sort_values("sales_outlet_id", ignore_index=True, inplace=True)

In [44]:
columns = [
    "sales_outlet_id",
    "manager",
    "sales_outlet_type",
    "store_address",
    "store_city",
    "store_state_province",
    "Neighorhood",  # "store_neighborhood"
    "store_telephone",
    "store_postal_code",
]
df_to_save = df_sales_outlet[columns]
df_to_save.head()

,sales_outlet_id,manager,sales_outlet_type,store_address,store_city,store_state_province,Neighorhood,store_telephone,store_postal_code
0,0,<NA>,headquarter,NaN,NaN,NaN,NaN,NaN,<NA>
1,1,<NA>,FL,NaN,NaN,NaN,NaN,NaN,<NA>
2,2,<NA>,warehouse,164-14 Jamaica Ave,Jamaica,NY,Jamaica,972-871-0402,11432
3,3,6,retail,32-20 Broadway,Long Island City,NY,Astoria,777-718-3190,11106
4,4,11,retail,604 Union Street,Brooklyn,NY,Gowanus,619-347-5193,11215

In [45]:
df_to_save.to_csv(
    FILE_PATH("SalesOutlet.csv", data_path="cleaned_data"),
    index=False,
    header=[
        "sales_outlet_id",
        "manager",
        "sales_outlet_type",
        "store_address",
        "store_city",
        "store_state_province",
        "store_neighborhood",  # "store_neighborhood"
        "store_telephone",
        "store_postal_code",
    ]
)

# Staff

In [46]:
df_staff = df[STAFF]
df_staff["start_date"] = pd.to_datetime(df_staff["start_date"])
df_staff["location"] = df_staff["location"].replace("HQ", 0).replace("WH", 2).replace("FL", 1).apply(lambda x: int(x))
df_staff.head()

,staff_id,first_name,last_name,position,start_date,location,Unnamed: 6,Unnamed: 7
0,1,Sue,Tindale,CFO,2001-08-03,0,NaN,NaN
1,2,Ian,Tindale,CEO,2001-08-03,0,NaN,NaN
2,3,Marny,Hermione,Roaster,2007-10-24,2,NaN,NaN
3,4,Chelsea,Claudia,Roaster,2003-07-03,2,NaN,NaN
4,5,Alec,Isadora,Roaster,2008-04-02,2,NaN,NaN

In [47]:
columns = [
    "staff_id",
    "position",
    "location",
    "first_name",
    "last_name",
    "start_date",
]
df_to_save = df_staff[columns]
df_to_save.head()

   staff_id position  location first_name last_name start_date
0         1      CFO         0        Sue   Tindale 2001-08-03
1         2      CEO         0        Ian   Tindale 2001-08-03
2         3  Roaster         2      Marny  Hermione 2007-10-24
3         4  Roaster         2    Chelsea   Claudia 2003-07-03
4         5  Roaster         2       Alec   Isadora 2008-04-02

In [48]:
df_to_save.to_csv(
    FILE_PATH("Staff.csv", data_path="cleaned_data"),
    index=False,
#     header=[
#         "sales_outlet_id",
#         "year_month",
#         "beans_goal",
#         "beverage_goal",
#         "food_goal",
#         "merchandise_goal",  # merchandise_goal
#     ]
)